Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Executing a whole row of programs this way is possible. But a shell is much better at it. You can start a new shell this way: >
es_es: Es imposible ejecutar una fila de programas de esta manera. Pero una consola es mejor para estas funciones. Puede iniciar una nueva consola de la siguiente manera: >

source: This is similar to using CTRL-Z to suspend Vim. The difference is that a new shell is started.
es_es: Esto es parecido al uso de «CTRL-Z» para suspender Vim. La diferencia es que se inicia una nueva consola.

source: When using the GUI the shell will be using the Vim window for its input and output. Since Vim is not a terminal emulator, this will not work perfectly. If you have trouble, try toggling the 'guipty' option. If this still doesn't work well enough, start a new terminal to run the shell in. For example with: > :!xterm&
es_es: Al usar la GUI, la consola usará la ventana de Vim para entrada y salida. Ya que Vim no es una terminal, esto no funcionará perfectamente. Si tiene un problema, pruebe a conmutar la opción 'guipty'. Si esto tampoco funciona, inicie una nueva terminal para iniciar el intérprete de órdenes. Por ejemplo, con: > :!xterm&

source: *21.3* Remembering information; viminfo
es_es: *21.3* Recordar información; viminfo

source: Command-line and Search pattern history Text in registers Marks for various files The buffer list Global variables
es_es: Histórico de la línea de órdenes y patrones de búsqueda Texto en registros Marcas para varios archivos La lista de búfers Variables globales

source: Each time you exit Vim it will store this information in a file, the viminfo file. When Vim starts again, the viminfo file is read and the information restored.
es_es: Cada vez que cierre Vim, este guardará esta información en un archivo, el archivo viminfo. Cuando inicie Vim otra vez, leerá el archivo viminfo y restaurará la información.

source: The 'viminfo' option is set by default to restore a limited number of items. You might want to set it to remember more information. This is done through the following command: >
es_es: La opción 'viminfo' esta configurada por omisión para almacenar un limitado número de elementos. Puede que desee configurarlo para que recuerde más información. Esto se hace con la siguiente orden: >

source: The f option controls whether global marks (A-Z and 0-9) are stored. If this option is 0, none are stored. If it is 1 or you do not specify an f option, the marks are stored. You want this feature, so now you have this: >
es_es: La opción «f» controla si se guardan las marcas globales (A-Z y 0-9). Si esta opción es 0, no se guarda nada. Si es 1 o no especificó una opción «f», las marcas se guardan. Desea esta función, y por ello ahora obtiene esto: >

source: The < option controls how many lines are saved for each of the registers. By default, all the lines are saved. If 0, nothing is saved. To avoid adding thousands of lines to your viminfo file (which might never get used and makes starting Vim slower) you use a maximum of 500 lines: >
es_es: La opción «<» define el número de líneas a guardar por cada registro. Por omisión, todas las líneas se guardan. Si es 0, nada se guarda. Para evitar que se añadan miles de líneas a su archivo viminfo (que puede que nunca se usen, y ralenticen el arranque de Vim) puede usar un máximo de 500 líneas: >

source: :set viminfo='1000,f1,<500 < Other options you might want to use: : number of lines to save from the command line history @ number of lines to save from the input line history / number of lines to save from the search history r removable media, for which no marks will be stored (can be used several times) ! global variables that start with an uppercase letter and don't contain lowercase letters h disable 'hlsearch' highlighting when starting % the buffer list (only restored when starting Vim without file arguments) c convert the text using 'encoding' n name used for the viminfo file (must be the last option)
es_es: :set viminfo='1000,f1,<500 < Otras opciones que puede que desee usar: : número de líneas a guardar del historial de la línea de órdenes @ número de líneas a guardar de la línea de entrada del historial / número de líneas a guardar del historial de búsquedas r dispositivos extraíbles, del cual no se guardan marcas (se puede introducir varias veces) ! variables globales que comienzan con mayúscula y que no contienen minúsculas h desactivar el resaltado de 'hlsearch' al inicio % la lista de búfers (solo se restaura si inicia Vim sin argumentos de archivo) c convertir el texto usando 'encoding' n nombre usado para el archivo viminfo (tiene que ser la última opción)

source: If you want to go back to a file that you edited recently, but not when exiting Vim, there is a slightly more complicated way. You can see a list of files by typing the command: >
es_es: Si desea volver a un archivo que editó recientemente, pero no al cerrar Vim, hay una manera un tanto más complicada. Puede ver una lista de archivos tecleando la orden: >

source: Now you would like to edit the second file, which is in the list preceded by "2:". You type: >
es_es: Ahora le gustaría editar el segundo archivo, que está en la lista precedido por «2:». Teclee: >

source: Instead of ":e" you can use any command that has a file name argument, the "#<2" item works in the same place as "%" (current file name) and "#" (alternate file name). So you can also split the window to edit the third file: >
es_es: En lugar de «:e», puede usar cualquier orden que tiene un nombre de archivo como argumento, el elemento «#<2» funciona en el mismo lugar que «%» (nombre del archivo actual) y «#» (nombre de archivo alterno). Puede también dividir la ventana para editar el tercer archivo: >

source: That #<123 thing is a bit complicated when you just want to edit a file. Fortunately there is a simpler way: >
es_es: Usar #<123 es poco complicado cuando solo quiere editar un archivo. Afortunadamente, hay una manera más simple: >

source: :browse oldfiles < 1: ~/.viminfo ~ 2: ~/text/resume.txt ~ 3: /tmp/draft ~ -- More --
es_es: :browse oldfiles < 1: ~/.viminfo ~ 2: ~/text/resume.txt ~ 3: /tmp/draft ~ -- Más --

source: You get the same list of files as with |:oldfiles|. If you want to edit "resume.txt" first press "q" to stop the listing. You will get a prompt:
es_es: Obtendrá la misma lista de archivos que con |:oldfiles|. Si desea editar «resume.txt», pulse primero «q» para detener el listado. Obtendrá un dialogo:

source: Type number and <Enter> (empty cancels): ~
es_es: Teclee el número y pulse <Intro> (vaciar cancelaciones): ~

source: You can use the ":wviminfo" and ":rviminfo" commands to save and restore the information while still running Vim. This is useful for exchanging register contents between two instances of Vim, for example. In the first Vim do: >
es_es: Puede emplear las órdenes «:wviminfo» y «:rviminfo» para guardar y restaurar la información mientras Vim se está ejecutando. Ésto es útil para intercambiar los contenidos del registro de dos instancias de Vim, por ejemplo. En el primer Vim, haga: >

source: Obviously, the "w" stands for "write" and the "r" for "read". The ! character is used by ":wviminfo" to forcefully overwrite an existing file. When it is omitted, and the file exists, the information is merged into the file. The ! character used for ":rviminfo" means that all the information is used, this may overwrite existing information. Without the ! only information that wasn't set is used. These commands can also be used to store info and use it again later. You could make a directory full of viminfo files, each containing info for a different purpose.
es_es: Obviamente, «w» significa «write», y «r», «read». El caracter «!» se usa por «:wviminfo» para forzar la sobreescritura de un archivo existente. Cuando se omite, y el archivo existe, la información es fusionada en el archivo. El caracter «!» usado por «:rviminfo» significa que se usa toda la información, y esto puede sobreescribir información ya presente. Sin «!» sólo se usa la información que no estaba definida. Estas órdenes se pueden usar también para guardar info y usarlo más tarde. Puede crear un directorio lleno de archivos «viminfo», cada uno con info dependiendo del propósito.

source: *21.4* Sessions
es_es: *21.4* Sesiones

source: This tells Vim to read a specific file on startup. The 'S' stands for session (actually, you can source any Vim script with -S, thus it might as well stand for "source").
es_es: Esto le dice a Vim que lea un archivo en particular al inicio. La «S» significa sesión (en realidad, puede introducir cualquier script a Vim con «-S», por ello también puede significar «source», fuente).

source: The windows that were open are restored, with the same position and size as before. Mappings and option values are like before. What exactly is restored depends on the 'sessionoptions' option. The default value is "blank,buffers,curdir,folds,help,options,winsize".
es_es: Las ventanas que estaban abiertas se restauran, con la misma posición y tamaño que antes. Las macros y valores de opciones son también las mismas. Lo que se restaura exactamente depende de la opción 'sessionoptions'. El valor predeterminado es «blank,buffers,curdir,folds,help,options,winsize».

source: blank keep empty windows buffers all buffers, not only the ones in a window curdir the current directory folds folds, also manually created ones help the help window options all options and mappings winsize window sizes
es_es: blank mantener ventanas vacías buffers todos los «buffers», no sólo los de una ventana curdir el directorio actual folds pliegues, también los manualmente creados help la ventana de ayuda options todas las opciones y macros winsize tamaño de ventanas

source: Change this to your liking. To also restore the size of the Vim window, for example, use: >
es_es: Modifique esto según su convenienvia. Para también restaurar el tamaño de la ventana de Vim use, por ejemplo: >

source: The obvious way to use sessions is when working on different projects. Suppose you store you session files in the directory "~/.vim". You are currently working on the "secret" project and have to switch to the "boring" project: >
es_es: La manera obvia de usar sesiones es cuando trabaja en diferenes proyetos. Suponga que guarda sus archivos de sesión en el directorio «~/.vim». Está trabajando actualmente en el proyecto «secreto» y tiene que cambiar al proyecto «aburrido»: >

source: :wall :mksession! ~/.vim/secret.vim :source ~/.vim/boring.vim
es_es: :wall :mksession! ~/.vim/secreto.vim :source ~/.vim/aburrido.vim

source: :source ~/.vim/boring.vim
es_es: :source ~/.vim/aburrido.vim

source: Thus you have complete control over whether you want to continue next time where you are now, by saving the current setup in a session, or keep the session file as a starting point. Another way of using sessions is to create a window layout that you like to use, and save this in a session. Then you can go back to this layout whenever you want. For example, this is a nice layout to use:
es_es: Por ello, ahora tiene un completo control sobre continuar en el mismo punto la siguiente vez que lo abra, guardando la configuración actual en una sesión, o mantener el archivo de sesión como un punto de partida. Otra manera de usar sesiones es crear una organización de ventana que le gusta usar, y guardarla en una sesión. Después podrá volver a este orden siempre que quiera. Por ejemplo, esta es una bonita organización que puede usar:

source: +----------------------------------------+ | VIM - main help file | | | |Move around: Use the cursor keys, or "h| |help.txt================================| |explorer | | |dir |~ | |dir |~ | |file |~ | |file |~ | |file |~ | |file |~ | |~/=========|[No File]===================| | | +----------------------------------------+
es_es: +----------------------------------------+ | VIM - main help file | | | |Desplazarse: Use las teclas de direcció| |help.txt================================| |explorer | | |dir |~ | |dir |~ | |file |~ | |file |~ | |file |~ | |file |~ | |~/=========|[No File]===================| | | +----------------------------------------+

source: This has a help window at the top, so that you can read this text. The narrow vertical window on the left contains a file explorer. This is a Vim plugin that lists the contents of a directory. You can select files to edit there. More about this in the next chapter. Create this from a just started Vim with: >
es_es: Ésta tiene una ventana de ayuda en la parte superior, para que pueda leer este texto. La estrecha ventana vertical a la izquierda contiene un explorador de archivos. Esta es una extensión de Vim que lista los contenidos de un directorio. Puede seleccionar qué archivos editar ahí. Más acerca de esto en el siguiente capítulo. Puede crear esto con una instancia nueva de Vim con: >

source: You can resize the windows a bit to your liking. Then save the session with: > :mksession ~/.vim/mine.vim
es_es: Puede redimensionar las ventanas a su gusto. Guarde entonces la sesión con: > :mksession ~/.vim/mio.vim

source: vim -S ~/.vim/mine.vim
es_es: vim -S ~/.vim/mio.vim

source: Hint: To open a file you see listed in the explorer window in the empty window, move the cursor to the filename and press "O". Double clicking with the mouse will also do this.
es_es: Pista: Para abrir un archivo que vea listado en la ventana del explorador en la ventana vacía, mueva el cursor al nombre del archivo y pulse «O». Pulsar dos veces con el ratón le daría el mismo resultado.

source: Some people have to do work on MS-Windows systems one day and on Unix another day. If you are one of them, consider adding "slash" and "unix" to 'sessionoptions'. The session files will then be written in a format that can be used on both systems. This is the command to put in your vimrc file: >
es_es: Hay gente que tiene que trabajar un día con sistemas MS-WINDOWS y con Unix al siguiente. Si es uno de ellos, considere añadir «slash» y «unix» a 'sessionoptions'. Los archivos de sesión se guardarán en un formato que les permita ser usados en ambos sistemas. Esta es una orden para poner en su archivo vimrc: >

source: Vim will use the Unix format then, because the MS-Windows Vim can read and write Unix files, but Unix Vim can't read MS-Windows format session files. Similarly, MS-Windows Vim understands file names with / to separate names, but Unix Vim doesn't understand \.
es_es: Vim usará el formato Unix, porque Vim para MS-Windows puede leer y escribir archivos de Unix, pero Vim para Unix no puede leer los archivos de sesión con formato de MS-Windows. De manera similar, Vim para MS-Windows entiene los nombres de archivo con «/» como diferentes palabras, pero Vim para Unix no entiende «\».

source: Sessions store many things, but not the position of marks, contents of registers and the command line history. You need to use the viminfo feature for these things. In most situations you will want to use sessions separately from viminfo. This can be used to switch to another session, but keep the command line history. And yank text into registers in one session, and paste it back in another session. You might prefer to keep the info with the session. You will have to do this yourself then. Example: >
es_es: Las sesiones guardan muchas cosas, pero no la posición de las marcas, contenidos de registros e historiales de la línea de órdenes. Precisa emplear «viminfo» para estas cosas. En la mayoría de las situaciones deseará usar sesiones separadas de «viminfo». Puede emplear esto para pasar a otra sesión, pero manteniendo el historial de la línea de órdenes. También puede copiar el texto de los registros de una sesión, y pegarlos en otra sesión diferente. Puede que prefiera mantener el información en la sesión. Tendrá que hacer esto usted mismo. Ejemplo: >

source: :mksession! ~/.vim/secret.vim :wviminfo! ~/.vim/secret.viminfo
es_es: :mksession! ~/.vim/secreto.vim :wviminfo! ~/.vim/secreto.viminfo

source: :source ~/.vim/secret.vim :rviminfo! ~/.vim/secret.viminfo
es_es: :source ~/.vim/secreto.vim :rviminfo! ~/.vim/secreto.viminfo

source: *21.5* Views
es_es: *21.5* Vistas

source: A session stores the looks of the whole of Vim. When you want to store the properties for one window only, use a view. The use of a view is for when you want to edit a file in a specific way. For example, you have line numbers enabled with the 'number' option and defined a few folds. Just like with sessions, you can remember this view on the file and restore it later. Actually, when you store a session, it stores the view of each window. There are two basic ways to use views. The first is to let Vim pick a name for the view file. You can restore the view when you later edit the same file. To store the view for the current window: >
es_es: Una sesión guarda el aspecto completo de Vim. Cuando desea guardar sólo las propiedades de una ventana, use una vista. El uso de una vista es útil cuando desea editar un archivo de una manera específica. Por ejemplo, ha activado el número de líneas con la opción 'number' y definido algunos plegados. Al igual que con las sesiones, puede guardar esta vista en el archivo y restaurarla más tarde. En realidad, cuando guarda una sesión, éste guarda la vista de cada ventana. Hay dos maneras básicas de usar las vistas. La primera es dejar que Vim escoja el nombre para el archivo de la vista. Puede restaurar la vista posteriormente cuando edite el mismo archivo. Para guardar la vista de la ventana actual: >

source: Vim will decide where to store the view. When you later edit the same file you get the view back with this command: >
es_es: Vim decidirá donde guardar la vista. Cuando más tarde edite el mismo archivo puede recuperar la vista con esta orden: >

source: That's easy, isn't it? Now you want to view the file without the 'number' option on, or with all folds open, you can set the options to make the window look that way. Then store this view with: >
es_es: Fácil, ¿no? Cuando quiere ver el archivo sin la opción 'number' activada, o con todos los plegados abiertos, puede definir las opciones para que la ventana presente ese aspecto. Una vez hecho ésto, guarde ésta vista con: >

source: Now you can switch between the two views on the file by using ":loadview" with and without the "1" argument. You can store up to ten views for the same file this way, one unnumbered and nine numbered 1 to 9.
es_es: Ahora puede pasar de una vista a otra del archivo usando «:loadview» con y sin el argumento «1». De esta forma, puede guardar hasta diez vistas para el mismo archivo, uno sin numerar y nueve numerados del 1 al 9.

source: The second basic way to use views is by storing the view in a file with a name you chose. This view can be loaded while editing another file. Vim will then switch to editing the file specified in the view. Thus you can use this to quickly switch to editing another file, with all its options set as you saved them. For example, to save the view of the current file: >
es_es: La segunda manera básica de usar las vistas se puede hacer guardando la vista en un archivo con un nombre de su elección. Puede cargar esta vista mientras edita un archivo distinto. Entonces, Vim pasará a editar el archivo especificado en la vista. Por ello, puede usar ésto para pasar rápidamente a editar otro archivo, con todas las opciones definidas tal y como las guardó. Por ejemplo, para guardar la vista del archivo actual: >

source: :mkview ~/.vim/main.vim
es_es: :mkview ~/.vim/principal.vim

source: :source ~/.vim/main.vim
es_es: :source ~/.vim/principal.vim

source: When editing a specific file, you might set options specifically for that file. Typing these commands each time is boring. Using a session or view for editing a file doesn't work when sharing the file between several people. The solution for this situation is adding a modeline to the file. This is a line of text that tells Vim the values of options, to be used in this file only. A typical example is a C program where you make indents by a multiple of 4 spaces. This requires setting the 'shiftwidth' option to 4. This modeline will do that:
es_es: Al editar un archivo en particular, puede que defina opciones específicas para ese archivo. Teclear estas órdenes es aburrido. Usar una sesión o vista para editar un archivo no funciona cuando comparte el archivo con varias personas. La solución para esta situación es añadir un «modeline» al archivo. Éste es una línea de texto que le dice a Vim los valores de las opciones para su uso con este archivo en particular. Un ejemplo típico es un programa en C en el que introduce los tabulados como múltiplos de 4. Esto requiere que configure la opción 'shiftwidth' a 4. Este «modeline» hará esta función:

source: Put this line as one of the first or last five lines in the file. When editing the file, you will notice that 'shiftwidth' will have been set to four. When editing another file, it's set back to the default value of eight. For some files the modeline fits well in the header, thus it can be put at the top of the file. For text files and other files where the modeline gets in the way of the normal contents, put it at the end of the file.
es_es: Ponga esta línea como uno de las primeras o cinco últimas líneas en el archivo. Cuando edite el archivo, notará que 'shiftwidth' se ha definido con valor de cuatro. Cuando edite otro archivo, esta opción será devuelta a su valor predeterminado de ocho. Para algunas líneas, el «modeline» encaja en la cabecera, y por ello puede ponerlo al inicio del archivo. Para los archivos de texto y otros archivos en los que el «modeline» se interpone en el camino de los contenidos normales, póngala al final del archivo.

source: The 'modelines' option specifies how many lines at the start and end of the file are inspected for containing a modeline. To inspect ten lines: >
es_es: La opción «modelines» especifica cuantas líneas son inspeccionadas al inicio y final del archivo en busca de un «modeline». Para inspeccionar diez líneas: >

source: The 'modeline' option can be used to switch this off. Do this when you are working as root on Unix or Administrator on MS-Windows, or when you don't trust the files you are editing: >
es_es: Puede usar la opción 'modeline' para desactivar ésto. Haga ésto cuando trabaje como «root» en Unix, o administrador en MS-Windows; o cuando no confía en los archivos que está editando: >

source: any-text vim:set {option}={value} ... : any-text ~
es_es: any-text vim:set {opción}={valor} ... : any-text ~

source: The "any-text" indicates that you can put any text before and after the part that Vim will use. This allows making it look like a comment, like what was done above with /* and */. The " vim:" part is what makes Vim recognize this line. There must be white space before "vim", or "vim" must be at the start of the line. Thus using something like "gvim:" will not work. The part between the colons is a ":set" command. It works the same way as typing the ":set" command, except that you need to insert a backslash before a colon (otherwise it would be seen as the end of the modeline).
es_es: «any-text» indica que puede introducir texto antes y después de la parte que Vim usará. Esto permite que presente el aspecto de un comentario, de la manera en que se hizo antes con /* y */. La parte de «vim:» es lo que hace que Vim reconozca esta línea. Debe haber un espacio en blanco antes de «vim», o «vim» ha de estar al inicio de la línea. Por ello, usar algo como «gvim» no funcionaría. La parte entre los dos puntos es una orden «:set». Funciona de la misma manera que teclear la orden «:set», con la excepción de que tiene que introducir una barra inversa antes de un colon (en caso contrario, se vería como el final de un «modeline»).
